---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryConnectorData.Dispose
source: html/d9b79d33-c218-4d79-2f46-696837b760e5.htm
---
# Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryConnectorData.Dispose Method

Releases all resources used by the PipeFittingAndAccessoryConnectorData

## Syntax (C#)
```csharp
public void Dispose()
```